Revit 2021.1 API
UnitUtils.GetValidUnits Method
 Gets the identifiers of all valid units for a given spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
public static IList<ForgeTypeId> GetValidUnits(
	ForgeTypeId specTypeId
)
Visual Basic
Public Shared Function GetValidUnits ( _
	specTypeId As ForgeTypeId _
) As IList(Of ForgeTypeId)
Visual C++
public:
static IList<ForgeTypeId^>^ GetValidUnits(
	ForgeTypeId^ specTypeId
)
Parameters
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the spec.
Return Value
 Identifiers of the valid units.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace